rocketNozzle_frozenFlow/Case_Study/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Generated from x-r contour CSV
// Wedge angle = 5 degrees
// Blocks = 8, radial cells/block = 30

scale 1.0;

vertices
(
    // x = -0.0402395592816 m, r = 0.067065932136 m
    (-0.0402395592816 0 -0)
    (-0.0402395592816 0.0670021002292 -0.00292537487286)
    (-0.0402395592816 0 0)
    (-0.0402395592816 0.0670021002292 0.00292537487286)
    // x = -0.0281676914971 m, r = 0.0383325035202 m
    (-0.0281676914971 0 -0)
    (-0.0281676914971 0.0382960194706 -0.00167204031973)
    (-0.0281676914971 0 0)
    (-0.0281676914971 0.0382960194706 0.00167204031973)
    // x = -0.0160958237127 m, r = 0.0301875658637 m
    (-0.0160958237127 0 -0)
    (-0.0160958237127 0.03015883399 -0.00131676312903)
    (-0.0160958237127 0 0)
    (-0.0160958237127 0.03015883399 0.00131676312903)
    // x = -0.00724312067069 m, r = 0.0274850509225 m
    (-0.00724312067069 0 -0)
    (-0.00724312067069 0.0274588912442 -0.00119888108295)
    (-0.00724312067069 0 0)
    (-0.00724312067069 0.0274588912442 0.00119888108295)
    // x = 0 m, r = 0.0268263728544 m
    (0 0 -0)
    (0 0.0268008400917 -0.00117014994914)
    (0 0 0)
    (0 0.0268008400917 0.00117014994914)
    // x = 0.0170708755972 m, r = 0.033007958351 m
    (0.0170708755972 0 -0)
    (0.0170708755972 0.0329765420886 -0.00143978692145)
    (0.0170708755972 0 0)
    (0.0170708755972 0.0329765420886 0.00143978692145)
    // x = 0.0379352791049 m, r = 0.040453810691 m
    (0.0379352791049 0 -0)
    (0.0379352791049 0.0404153076271 -0.00176457043894)
    (0.0379352791049 0 0)
    (0.0379352791049 0.0404153076271 0.00176457043894)
    // x = 0.0663867384336 m, r = 0.0502722075004 m
    (0.0663867384336 0 -0)
    (0.0663867384336 0.0502243594983 -0.00219284289267)
    (0.0663867384336 0 0)
    (0.0663867384336 0.0502243594983 0.00219284289267)
    // x = 0.0948381977622 m, r = 0.0585911459819 m
    (0.0948381977622 0 -0)
    (0.0948381977622 0.0585353801937 -0.00255570989277)
    (0.0948381977622 0 0)
    (0.0948381977622 0.0585353801937 0.00255570989277)
);

blocks
(
    hex (0 4 5 1 2 6 7 3) (17 30 1) simpleGrading (1 0.15 1)
    hex (4 8 9 5 6 10 11 7) (17 30 1) simpleGrading (1 0.15 1)
    hex (8 12 13 9 10 14 15 11) (14 30 1) simpleGrading (1 0.15 1)
    hex (12 16 17 13 14 18 19 15) (12 30 1) simpleGrading (1 0.15 1)
    hex (16 20 21 17 18 22 23 19) (23 30 1) simpleGrading (1 0.15 1)
    hex (20 24 25 21 22 26 27 23) (27 30 1) simpleGrading (1 0.15 1)
    hex (24 28 29 25 26 30 31 27) (35 30 1) simpleGrading (1 0.15 1)
    hex (28 32 33 29 30 34 35 31) (35 30 1) simpleGrading (1 0.15 1)
);

edges
(
    spline 1 5
    (
        (-0.0395575328531 0.0596318779531 -0.00260358401884)
        (-0.0388755064246 0.0566236705419 -0.0024722428468)
        (-0.0381934799961 0.0543460787719 -0.00237280104256)
        (-0.0375114535676 0.0524518629303 -0.00229009779284)
        (-0.0368294271391 0.0508059469279 -0.00221823554823)
        (-0.0361474007106 0.04933878208 -0.00215417774757)
        (-0.0354653742821 0.0480088992274 -0.00209611380827)
        (-0.0347833478536 0.0467891833064 -0.00204285986108)
        (-0.0341013214251 0.0456607369472 -0.00199359082901)
        (-0.0334192949966 0.0446097574996 -0.00194770407535)
        (-0.0327372685681 0.0436257940822 -0.00190474330476)
        (-0.0320552421396 0.0427007048944 -0.00186435303855)
        (-0.0313732157111 0.04182799863 -0.00182624986016)
        (-0.0306911892826 0.041002399896 -0.00179020344097)
        (-0.0300091628541 0.0402195519284 -0.00175602356055)
        (-0.0293271364256 0.0394758069894 -0.00172355095523)
        (-0.0286451099971 0.0387680747362 -0.00169265069773)
    )
    spline 3 7
    (
        (-0.0395575328531 0.0596318779531 0.00260358401884)
        (-0.0388755064246 0.0566236705419 0.0024722428468)
        (-0.0381934799961 0.0543460787719 0.00237280104256)
        (-0.0375114535676 0.0524518629303 0.00229009779284)
        (-0.0368294271391 0.0508059469279 0.00221823554823)
        (-0.0361474007106 0.04933878208 0.00215417774757)
        (-0.0354653742821 0.0480088992274 0.00209611380827)
        (-0.0347833478536 0.0467891833064 0.00204285986108)
        (-0.0341013214251 0.0456607369472 0.00199359082901)
        (-0.0334192949966 0.0446097574996 0.00194770407535)
        (-0.0327372685681 0.0436257940822 0.00190474330476)
        (-0.0320552421396 0.0427007048944 0.00186435303855)
        (-0.0313732157111 0.04182799863 0.00182624986016)
        (-0.0306911892826 0.041002399896 0.00179020344097)
        (-0.0300091628541 0.0402195519284 0.00175602356055)
        (-0.0293271364256 0.0394758069894 0.00172355095523)
        (-0.0286451099971 0.0387680747362 0.00169265069773)
    )
    spline 5 9
    (
        (-0.0279630835686 0.0380937100711 -0.00166320730059)
        (-0.0272810571401 0.0374504285759 -0.00163512102395)
        (-0.0265990307116 0.0368362416562 -0.00160830504392)
        (-0.0259170042831 0.0362494060486 -0.00158268324795)
        (-0.0252349778546 0.0356883839811 -0.0015581884955)
        (-0.0245529514261 0.0351518113586 -0.00153476122886)
        (-0.0238709249976 0.0346384720799 -0.00151234835192)
        (-0.0231888985691 0.0341472771006 -0.00149090231597)
        (-0.0225068721406 0.033677247212 -0.00147038036784)
        (-0.0218248457121 0.0332274987602 -0.00145074392636)
        (-0.0211428192836 0.0327972317139 -0.00143195806142)
        (-0.0204607928551 0.0323857196287 -0.00141399105576)
        (-0.0197787664266 0.0319923011498 -0.00139681403401)
        (-0.0190967399981 0.0316163727778 -0.00138040064683)
        (-0.0184147135696 0.0312573826765 -0.00136472680051)
        (-0.0177326871411 0.0309148253452 -0.00134977042442)
        (-0.0170506607126 0.0305882370152 -0.00133551126999)
        (-0.0163686342841 0.0302771916554 -0.0013219307363)
    )
    spline 7 11
    (
        (-0.0279630835686 0.0380937100711 0.00166320730059)
        (-0.0272810571401 0.0374504285759 0.00163512102395)
        (-0.0265990307116 0.0368362416562 0.00160830504392)
        (-0.0259170042831 0.0362494060486 0.00158268324795)
        (-0.0252349778546 0.0356883839811 0.0015581884955)
        (-0.0245529514261 0.0351518113586 0.00153476122886)
        (-0.0238709249976 0.0346384720799 0.00151234835192)
        (-0.0231888985691 0.0341472771006 0.00149090231597)
        (-0.0225068721406 0.033677247212 0.00147038036784)
        (-0.0218248457121 0.0332274987602 0.00145074392636)
        (-0.0211428192836 0.0327972317139 0.00143195806142)
        (-0.0204607928551 0.0323857196287 0.00141399105576)
        (-0.0197787664266 0.0319923011498 0.00139681403401)
        (-0.0190967399981 0.0316163727778 0.00138040064683)
        (-0.0184147135696 0.0312573826765 0.00136472680051)
        (-0.0177326871411 0.0309148253452 0.00134977042442)
        (-0.0170506607126 0.0305882370152 0.00133551126999)
        (-0.0163686342841 0.0302771916554 0.0013219307363)
    )
    spline 9 13
    (
        (-0.0156866078555 0.0299812974919 -0.00130901171812)
        (-0.015004581427 0.0297001939662 -0.00129673847313)
        (-0.0143225549985 0.0294335490678 -0.00128509650544)
        (-0.01364052857 0.0291810569879 -0.00127407246316)
        (-0.0129585021415 0.0289424360514 -0.00126365404807)
        (-0.012276475713 0.028717426889 -0.00125382993588)
        (-0.0115944492845 0.0285057908193 -0.00124458970552)
        (-0.010912422856 0.0283073084145 -0.00123592377658)
        (-0.0102303964275 0.0281217782276 -0.00122782335368)
        (-0.00954836999903 0.0279490156609 -0.00122028037712)
        (-0.00886634357053 0.0277888519626 -0.00121328747903)
        (-0.00818431714203 0.0276411333341 -0.00120683794442)
        (-0.00750229071352 0.0275057201394 -0.00120092567667)
    )
    spline 11 15
    (
        (-0.0156866078555 0.0299812974919 0.00130901171812)
        (-0.015004581427 0.0297001939662 0.00129673847313)
        (-0.0143225549985 0.0294335490678 0.00128509650544)
        (-0.01364052857 0.0291810569879 0.00127407246316)
        (-0.0129585021415 0.0289424360514 0.00126365404807)
        (-0.012276475713 0.028717426889 0.00125382993588)
        (-0.0115944492845 0.0285057908193 0.00124458970552)
        (-0.010912422856 0.0283073084145 0.00123592377658)
        (-0.0102303964275 0.0281217782276 0.00122782335368)
        (-0.00954836999903 0.0279490156609 0.00122028037712)
        (-0.00886634357053 0.0277888519626 0.00121328747903)
        (-0.00818431714203 0.0276411333341 0.00120683794442)
        (-0.00750229071352 0.0275057201394 0.00120092567667)
    )
    spline 13 17
    (
        (-0.00682026428502 0.0273824862047 -0.00119554516688)
        (-0.00613823785652 0.0272713181997 -0.00119069146696)
        (-0.00545621142802 0.0271721150939 -0.00118636016582)
        (-0.00477418499951 0.0270847876812 -0.00118254736864)
        (-0.00409215857101 0.027009258167 -0.00117924967883)
        (-0.00341013214251 0.0269454598141 -0.00117646418259)
        (-0.00272810571401 0.0268933366425 -0.00117418843577)
        (-0.00204607928551 0.0268528431808 -0.00117242045305)
        (-0.001364052857 0.0268239442661 -0.00117115869918)
        (-0.000682026428502 0.0268066148903 -0.00117040208229)
    )
    spline 15 19
    (
        (-0.00682026428502 0.0273824862047 0.00119554516688)
        (-0.00613823785652 0.0272713181997 0.00119069146696)
        (-0.00545621142802 0.0271721150939 0.00118636016582)
        (-0.00477418499951 0.0270847876812 0.00118254736864)
        (-0.00409215857101 0.027009258167 0.00117924967883)
        (-0.00341013214251 0.0269454598141 0.00117646418259)
        (-0.00272810571401 0.0268933366425 0.00117418843577)
        (-0.00204607928551 0.0268528431808 0.00117242045305)
        (-0.001364052857 0.0268239442661 0.00117115869918)
        (-0.000682026428502 0.0268066148903 0.00117040208229)
    )
    spline 17 21
    (
        (0.00119658472146 0.0272358044153 -0.00118914090164)
        (0.00238571588453 0.0276677736914 -0.00120800108754)
        (0.00356739348922 0.0280967479199 -0.00122673050684)
        (0.00474161753551 0.0285227271009 -0.00124532915955)
        (0.00590838802341 0.0289457112344 -0.00126379704565)
        (0.00706770495292 0.0293657003203 -0.00128213416515)
        (0.00821956832404 0.0297826943587 -0.00130034051806)
        (0.00936397813677 0.0301966933496 -0.00131841610436)
        (0.0105009343911 0.0306076972929 -0.00133636092407)
        (0.0116304370871 0.0310157061887 -0.00135417497717)
        (0.0127524862246 0.031420720037 -0.00137185826368)
        (0.0138670818038 0.0318227388377 -0.00138941078359)
        (0.0149742238246 0.0322217625909 -0.00140683253689)
        (0.016073912287 0.0326177912966 -0.0014241235236)
    )
    spline 19 23
    (
        (0.00119658472146 0.0272358044153 0.00118914090164)
        (0.00238571588453 0.0276677736914 0.00120800108754)
        (0.00356739348922 0.0280967479199 0.00122673050684)
        (0.00474161753551 0.0285227271009 0.00124532915955)
        (0.00590838802341 0.0289457112344 0.00126379704565)
        (0.00706770495292 0.0293657003203 0.00128213416515)
        (0.00821956832404 0.0297826943587 0.00130034051806)
        (0.00936397813677 0.0301966933496 0.00131841610436)
        (0.0105009343911 0.0306076972929 0.00133636092407)
        (0.0116304370871 0.0310157061887 0.00135417497717)
        (0.0127524862246 0.031420720037 0.00137185826368)
        (0.0138670818038 0.0318227388377 0.00138941078359)
        (0.0149742238246 0.0322217625909 0.00140683253689)
        (0.016073912287 0.0326177912966 0.0014241235236)
    )
    spline 21 25
    (
        (0.017166147191 0.0330108249548 -0.00144128374371)
        (0.0182509285366 0.0334008635654 -0.00145831319722)
        (0.0193282563238 0.0337879071285 -0.00147521188413)
        (0.0203981305526 0.034171955644 -0.00149197980445)
        (0.0214605512231 0.0345530091121 -0.00150861695816)
        (0.0225155183351 0.0349310675325 -0.00152512334527)
        (0.0235630318888 0.0353061309055 -0.00154149896579)
        (0.024603091884 0.0356781992309 -0.0015577438197)
        (0.0256356983209 0.0360472725088 -0.00157385790702)
        (0.0266608511994 0.0364133507392 -0.00158984122773)
        (0.0276785505195 0.036776433922 -0.00160569378185)
        (0.0286887962812 0.0371365220573 -0.00162141556937)
        (0.0296915884845 0.0374936151451 -0.00163700659028)
        (0.0306869271294 0.0378477131853 -0.0016524668446)
        (0.031674812216 0.038198816178 -0.00166779633232)
        (0.0326552437441 0.0385469241232 -0.00168299505344)
        (0.0336282217139 0.0388920370208 -0.00169806300796)
        (0.0345937461252 0.0392341548709 -0.00171300019588)
        (0.0355518169782 0.0395732776735 -0.00172780661721)
        (0.0365024342728 0.0399094054286 -0.00174248227193)
        (0.037445598009 0.0402425381361 -0.00175702716005)
    )
    spline 23 27
    (
        (0.017166147191 0.0330108249548 0.00144128374371)
        (0.0182509285366 0.0334008635654 0.00145831319722)
        (0.0193282563238 0.0337879071285 0.00147521188413)
        (0.0203981305526 0.034171955644 0.00149197980445)
        (0.0214605512231 0.0345530091121 0.00150861695816)
        (0.0225155183351 0.0349310675325 0.00152512334527)
        (0.0235630318888 0.0353061309055 0.00154149896579)
        (0.024603091884 0.0356781992309 0.0015577438197)
        (0.0256356983209 0.0360472725088 0.00157385790702)
        (0.0266608511994 0.0364133507392 0.00158984122773)
        (0.0276785505195 0.036776433922 0.00160569378185)
        (0.0286887962812 0.0371365220573 0.00162141556937)
        (0.0296915884845 0.0374936151451 0.00163700659028)
        (0.0306869271294 0.0378477131853 0.0016524668446)
        (0.031674812216 0.038198816178 0.00166779633232)
        (0.0326552437441 0.0385469241232 0.00168299505344)
        (0.0336282217139 0.0388920370208 0.00169806300796)
        (0.0345937461252 0.0392341548709 0.00171300019588)
        (0.0355518169782 0.0395732776735 0.00172780661721)
        (0.0365024342728 0.0399094054286 0.00174248227193)
        (0.037445598009 0.0402425381361 0.00175702716005)
    )
    spline 25 29
    (
        (0.0383813081868 0.0405726757961 -0.00177144128158)
        (0.0393095648062 0.0408998184085 -0.0017857246365)
        (0.0402303678672 0.0412239659734 -0.00179987722483)
        (0.0411437173699 0.0415451184908 -0.00181389904655)
        (0.0420496133141 0.0418632759607 -0.00182779010168)
        (0.0429480556999 0.042178438383 -0.00184155039021)
        (0.0438390445274 0.0424906057578 -0.00185517991214)
        (0.0447225797965 0.042799778085 -0.00186867866747)
        (0.0455986615072 0.0431059553648 -0.0018820466562)
        (0.0464672896595 0.043409137597 -0.00189528387833)
        (0.0473284642534 0.0437093247816 -0.00190839033386)
        (0.0481821852889 0.0440065169187 -0.00192136602279)
        (0.049028452766 0.0443007140083 -0.00193421094512)
        (0.0498672666847 0.0445919160504 -0.00194692510086)
        (0.0506986270451 0.0448801230449 -0.00195950848999)
        (0.051522533847 0.045165334992 -0.00197196111253)
        (0.0523389870906 0.0454475518914 -0.00198428296846)
        (0.0531479867757 0.0457267737434 -0.0019964740578)
        (0.0539495329025 0.0460030005478 -0.00200853438054)
        (0.0547436254709 0.0462762323047 -0.00202046393667)
        (0.0555302644809 0.046546469014 -0.00203226272621)
        (0.0563094499325 0.0468137106758 -0.00204393074915)
        (0.0570811818257 0.0470779572901 -0.00205546800549)
        (0.0578454601605 0.0473392088568 -0.00206687449523)
        (0.058602284937 0.0475974653761 -0.00207815021837)
        (0.059351656155 0.0478527268477 -0.00208929517492)
        (0.0600935738147 0.0481049932719 -0.00210030936486)
        (0.0608280379159 0.0483542646485 -0.0021111927882)
        (0.0615550484588 0.0486005409776 -0.00212194544495)
        (0.0622746054433 0.0488438222592 -0.00213256733509)
        (0.0629867088694 0.0490841084932 -0.00214305845864)
        (0.0636913587371 0.0493213996797 -0.00215341881558)
        (0.0643885550464 0.0495556958187 -0.00216364840593)
        (0.0650782977974 0.0497869969101 -0.00217374722968)
        (0.0657605869899 0.050015302954 -0.00218371528683)
    )
    spline 27 31
    (
        (0.0383813081868 0.0405726757961 0.00177144128158)
        (0.0393095648062 0.0408998184085 0.0017857246365)
        (0.0402303678672 0.0412239659734 0.00179987722483)
        (0.0411437173699 0.0415451184908 0.00181389904655)
        (0.0420496133141 0.0418632759607 0.00182779010168)
        (0.0429480556999 0.042178438383 0.00184155039021)
        (0.0438390445274 0.0424906057578 0.00185517991214)
        (0.0447225797965 0.042799778085 0.00186867866747)
        (0.0455986615072 0.0431059553648 0.0018820466562)
        (0.0464672896595 0.043409137597 0.00189528387833)
        (0.0473284642534 0.0437093247816 0.00190839033386)
        (0.0481821852889 0.0440065169187 0.00192136602279)
        (0.049028452766 0.0443007140083 0.00193421094512)
        (0.0498672666847 0.0445919160504 0.00194692510086)
        (0.0506986270451 0.0448801230449 0.00195950848999)
        (0.051522533847 0.045165334992 0.00197196111253)
        (0.0523389870906 0.0454475518914 0.00198428296846)
        (0.0531479867757 0.0457267737434 0.0019964740578)
        (0.0539495329025 0.0460030005478 0.00200853438054)
        (0.0547436254709 0.0462762323047 0.00202046393667)
        (0.0555302644809 0.046546469014 0.00203226272621)
        (0.0563094499325 0.0468137106758 0.00204393074915)
        (0.0570811818257 0.0470779572901 0.00205546800549)
        (0.0578454601605 0.0473392088568 0.00206687449523)
        (0.058602284937 0.0475974653761 0.00207815021837)
        (0.059351656155 0.0478527268477 0.00208929517492)
        (0.0600935738147 0.0481049932719 0.00210030936486)
        (0.0608280379159 0.0483542646485 0.0021111927882)
        (0.0615550484588 0.0486005409776 0.00212194544495)
        (0.0622746054433 0.0488438222592 0.00213256733509)
        (0.0629867088694 0.0490841084932 0.00214305845864)
        (0.0636913587371 0.0493213996797 0.00215341881558)
        (0.0643885550464 0.0495556958187 0.00216364840593)
        (0.0650782977974 0.0497869969101 0.00217374722968)
        (0.0657605869899 0.050015302954 0.00218371528683)
    )
    spline 29 33
    (
        (0.066435422624 0.0502406139503 -0.00219355257737)
        (0.0671028046998 0.0504629298992 -0.00220325910132)
        (0.0677627332171 0.0506822508005 -0.00221283485867)
        (0.0684152081761 0.0508985766543 -0.00222227984943)
        (0.0690602295767 0.0511119074605 -0.00223159407358)
        (0.0696977974189 0.0513222432192 -0.00224077753113)
        (0.0703279117027 0.0515295839304 -0.00224983022208)
        (0.0709505724281 0.051733929594 -0.00225875214644)
        (0.0715657795951 0.0519352802101 -0.00226754330419)
        (0.0721735332038 0.0521336357787 -0.00227620369535)
        (0.072773833254 0.0523289962998 -0.0022847333199)
        (0.0733666797459 0.0525213617733 -0.00229313217786)
        (0.0739520726793 0.0527107321993 -0.00230140026922)
        (0.0745300120544 0.0528971075777 -0.00230953759398)
        (0.0751004978711 0.0530804879087 -0.00231754415214)
        (0.0756635301294 0.053260873192 -0.0023254199437)
        (0.0762191088293 0.0534382634279 -0.00233316496866)
        (0.0767672339708 0.0536126586162 -0.00234077922702)
        (0.0773079055539 0.053784058757 -0.00234826271878)
        (0.0778411235786 0.0539524638503 -0.00235561544394)
        (0.078366888045 0.054117873896 -0.0023628374025)
        (0.0788851989529 0.0542802888942 -0.00236992859447)
        (0.0793960563025 0.0544397088449 -0.00237688901983)
        (0.0798994600936 0.054596133748 -0.0023837186786)
        (0.0803954103264 0.0547495636036 -0.00239041757076)
        (0.0808839070008 0.0548999984117 -0.00239698569633)
        (0.0813649501168 0.0550474381722 -0.0024034230553)
        (0.0818385396744 0.0551918828852 -0.00240972964767)
        (0.0823046756736 0.0553333325507 -0.00241590547343)
        (0.0827633581144 0.0554717871687 -0.0024219505326)
        (0.0832145869969 0.0556072467391 -0.00242786482517)
        (0.0836583623209 0.055739711262 -0.00243364835115)
        (0.0840946840866 0.0558691807373 -0.00243930111052)
        (0.0845235522938 0.0559956551651 -0.00244482310329)
        (0.0849449669427 0.0561191345454 -0.00245021432946)
        (0.0853589280332 0.0562396188782 -0.00245547478904)
        (0.0857654355653 0.0563571081634 -0.00246060448201)
        (0.086164489539 0.0564716024011 -0.00246560340839)
        (0.0865560899543 0.0565831015912 -0.00247047156816)
        (0.0869402368112 0.0566916057339 -0.00247520896134)
        (0.0873169301098 0.056797114829 -0.00247981558792)
        (0.0876861698499 0.0568996288765 -0.00248429144789)
        (0.0880479560317 0.0569991478766 -0.00248863654127)
        (0.088402288655 0.0570956718291 -0.00249285086805)
        (0.08874916772 0.057189200734 -0.00249693442823)
        (0.0890885932266 0.0572797345915 -0.00250088722181)
        (0.0894205651748 0.0573672734014 -0.00250470924879)
        (0.0897450835646 0.0574518171637 -0.00250840050918)
        (0.090062148396 0.0575333658786 -0.00251196100296)
        (0.090371759669 0.0576119195459 -0.00251539073014)
        (0.0906739173836 0.0576874781657 -0.00251868969073)
        (0.0909686215399 0.0577600417379 -0.00252185788471)
        (0.0912558721377 0.0578296102626 -0.0025248953121)
        (0.0915356691772 0.0578961837398 -0.00252780197288)
        (0.0918080126583 0.0579597621694 -0.00253057786707)
        (0.0920729025809 0.0580203455516 -0.00253322299466)
        (0.0923303389452 0.0580779338862 -0.00253573735565)
        (0.0925803217511 0.0581325271732 -0.00253812095004)
        (0.0928228509986 0.0581841254127 -0.00254037377783)
        (0.0930579266877 0.0582327286047 -0.00254249583902)
        (0.0932855488185 0.0582783367492 -0.00254448713361)
        (0.0935057173908 0.0583209498461 -0.0025463476616)
        (0.0937184324048 0.0583605678955 -0.00254807742299)
        (0.0939236938603 0.0583971908974 -0.00254967641779)
        (0.0941215017575 0.0584308188517 -0.00255114464598)
        (0.0943118560963 0.0584614517585 -0.00255248210758)
        (0.0944947568766 0.0584890896178 -0.00255368880257)
        (0.0946702040986 0.0585137324295 -0.00255476473097)
    )
    spline 31 35
    (
        (0.066435422624 0.0502406139503 0.00219355257737)
        (0.0671028046998 0.0504629298992 0.00220325910132)
        (0.0677627332171 0.0506822508005 0.00221283485867)
        (0.0684152081761 0.0508985766543 0.00222227984943)
        (0.0690602295767 0.0511119074605 0.00223159407358)
        (0.0696977974189 0.0513222432192 0.00224077753113)
        (0.0703279117027 0.0515295839304 0.00224983022208)
        (0.0709505724281 0.051733929594 0.00225875214644)
        (0.0715657795951 0.0519352802101 0.00226754330419)
        (0.0721735332038 0.0521336357787 0.00227620369535)
        (0.072773833254 0.0523289962998 0.0022847333199)
        (0.0733666797459 0.0525213617733 0.00229313217786)
        (0.0739520726793 0.0527107321993 0.00230140026922)
        (0.0745300120544 0.0528971075777 0.00230953759398)
        (0.0751004978711 0.0530804879087 0.00231754415214)
        (0.0756635301294 0.053260873192 0.0023254199437)
        (0.0762191088293 0.0534382634279 0.00233316496866)
        (0.0767672339708 0.0536126586162 0.00234077922702)
        (0.0773079055539 0.053784058757 0.00234826271878)
        (0.0778411235786 0.0539524638503 0.00235561544394)
        (0.078366888045 0.054117873896 0.0023628374025)
        (0.0788851989529 0.0542802888942 0.00236992859447)
        (0.0793960563025 0.0544397088449 0.00237688901983)
        (0.0798994600936 0.054596133748 0.0023837186786)
        (0.0803954103264 0.0547495636036 0.00239041757076)
        (0.0808839070008 0.0548999984117 0.00239698569633)
        (0.0813649501168 0.0550474381722 0.0024034230553)
        (0.0818385396744 0.0551918828852 0.00240972964767)
        (0.0823046756736 0.0553333325507 0.00241590547343)
        (0.0827633581144 0.0554717871687 0.0024219505326)
        (0.0832145869969 0.0556072467391 0.00242786482517)
        (0.0836583623209 0.055739711262 0.00243364835115)
        (0.0840946840866 0.0558691807373 0.00243930111052)
        (0.0845235522938 0.0559956551651 0.00244482310329)
        (0.0849449669427 0.0561191345454 0.00245021432946)
        (0.0853589280332 0.0562396188782 0.00245547478904)
        (0.0857654355653 0.0563571081634 0.00246060448201)
        (0.086164489539 0.0564716024011 0.00246560340839)
        (0.0865560899543 0.0565831015912 0.00247047156816)
        (0.0869402368112 0.0566916057339 0.00247520896134)
        (0.0873169301098 0.056797114829 0.00247981558792)
        (0.0876861698499 0.0568996288765 0.00248429144789)
        (0.0880479560317 0.0569991478766 0.00248863654127)
        (0.088402288655 0.0570956718291 0.00249285086805)
        (0.08874916772 0.057189200734 0.00249693442823)
        (0.0890885932266 0.0572797345915 0.00250088722181)
        (0.0894205651748 0.0573672734014 0.00250470924879)
        (0.0897450835646 0.0574518171637 0.00250840050918)
        (0.090062148396 0.0575333658786 0.00251196100296)
        (0.090371759669 0.0576119195459 0.00251539073014)
        (0.0906739173836 0.0576874781657 0.00251868969073)
        (0.0909686215399 0.0577600417379 0.00252185788471)
        (0.0912558721377 0.0578296102626 0.0025248953121)
        (0.0915356691772 0.0578961837398 0.00252780197288)
        (0.0918080126583 0.0579597621694 0.00253057786707)
        (0.0920729025809 0.0580203455516 0.00253322299466)
        (0.0923303389452 0.0580779338862 0.00253573735565)
        (0.0925803217511 0.0581325271732 0.00253812095004)
        (0.0928228509986 0.0581841254127 0.00254037377783)
        (0.0930579266877 0.0582327286047 0.00254249583902)
        (0.0932855488185 0.0582783367492 0.00254448713361)
        (0.0935057173908 0.0583209498461 0.0025463476616)
        (0.0937184324048 0.0583605678955 0.00254807742299)
        (0.0939236938603 0.0583971908974 0.00254967641779)
        (0.0941215017575 0.0584308188517 0.00255114464598)
        (0.0943118560963 0.0584614517585 0.00255248210758)
        (0.0944947568766 0.0584890896178 0.00255368880257)
        (0.0946702040986 0.0585137324295 0.00255476473097)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 3 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (32 33 35 34)
        );
    }

    nozzleWall
    {
        type wall;
        faces
        (
            (1 5 7 3)
            (5 9 11 7)
            (9 13 15 11)
            (13 17 19 15)
            (17 21 23 19)
            (21 25 27 23)
            (25 29 31 27)
            (29 33 35 31)
        );
    }

    wedgeMinus
    {
        type wedge;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
            (24 25 29 28)
            (28 29 33 32)
        );
    }

    wedgePlus
    {
        type wedge;
        faces
        (
            (2 6 7 3)
            (6 10 11 7)
            (10 14 15 11)
            (14 18 19 15)
            (18 22 23 19)
            (22 26 27 23)
            (26 30 31 27)
            (30 34 35 31)
        );
    }
);

mergePatchPairs
(
);
