rocketNozzle_frozenFlow/Case_Study/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (10 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    nozzleWall
    {
        type            noSlip;
    }
    wedgeMinus
    {
        type            wedge;
    }
    wedgePlus
    {
        type            wedge;
    }
}