rocketNozzle_frozenFlow/Case_Study/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 10;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 10;
        value           uniform 10;
    }
    nozzleWall
    {
        type            kqRWallFunction;
        value           uniform 10;
    }
    wedgeMinus
    {
        type            wedge;
    }
    wedgePlus
    {
        type            wedge;
    }
}