rocketNozzle_frozenFlow/Case_Study/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default                         none;
    div(tauMC)                      Gauss linear;
    div(phi,U)                      Gauss limitedLinearV 1;
    div(phi,e)                      Gauss limitedLinear 1;
    div(phi,K)                      Gauss limitedLinear 1;
    div(phi,Ekp)                    Gauss limitedLinear 1;
    div(phi,k)                      Gauss limitedLinear 1;
    div(phi,omega)                  Gauss limitedLinear 1;
    div((rho*nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    reconstruct(rho)    vanLeer;
    reconstruct(U)      vanLeerV;
    reconstruct(T)      vanLeer;
}

snGradSchemes
{
    default             corrected;
}

wallDist
{
    method meshWave;
}