rocketNozzle_frozenFlow/Case_Study/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-10;
        relTol           0.01;
    }

    e
    {
        $U;
        tolerance        1e-10;
        relTol           0.01;
    }

    "(k|omega)"
    {
	solver          smoothSolver;
	smoother        GaussSeidel;
	tolerance       1e-08;
	relTol          0.1;
    }
}

PIMPLE
{
    momentumPredictor   yes;
}

relaxationFactors
{
    equations
    {
        "(U|e|k|omega).*" 1;
    }
}