rocketNozzle_frozenFlow/Case_Study/system/solverInfo

// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U e k omega );


// ************************************************************************* //
